<template>
	<transition name="article">
		<div id="article" v-show="isShow">
			<div id="article_header">
				<i class="el-icon-arrow-left" @click="hide()"></i>
				<i class="el-icon-refresh"></i>
				<p>标题</p>
			</div>
			<div id="article_con">
				<p id="article_title">标题</p>
				<p id="article_createTime">发布时间：2015年2月21</p>
				<p id="article_resource">来源：河南博物院</p>
				<p class="article_main">天翻地覆，人间正道是沧桑；蓦然回首，我们已经走过一段曲折的历程，而将足迹深深镌印在历史的深层——河南博物院自1927年创建以来，经历了数十年的风风雨雨，倾注了一代又一代人的心血和汗水。如今，她伴随着民族的振兴、祖国的强盛，正逐步走向辉煌，在社会主义精神文明建设中起着越来越重要的作用。河南博物院的发展，引人自豪，催人奋进。它作为中国博物馆事业发展史的一个缩影，将永远铭记史册。
				　　一、从河南博物馆到河南博物院

				    河南博物院是中国历史上创建较早的博物馆之一。早在1927年6月，时任国民革命军总司令、河南省政府主席的冯玉祥将军在治豫政纲中就提出了“教育为立国根本要政”的主张，并身体力行，极力扶持文化教育事业。同年7月，在冯玉祥将军的亲切关怀下，由省政府委派郭须静、徐金泉、何日章三人为河南博物馆筹备委员，隶属省教育厅，指定开封法院西街前法政学校校舍为馆址（即今开封市三圣庙街），是为河南博物院发韧之始。

				    然而，这座解放前河南唯一的博物馆，从其诞生之日起，便随着时局的动荡，走上了一条坎坷之路。1928年5月，原河南省政府为表现各民族的历史和现状，宣传民族共和和世界大同的理想，遂将河南博物馆改名为“民族博物院”，并改由省政府直接领导，同时划拨刘师古堂充公遗产的一部分为专款，限期开放。河南省民族博物院以“启发民众知识文明、激增革命思想、促进社会文明”为办院宗旨，广泛征集历史、自然科学、农业、艺术、生理卫生等方面的实物料。同年10月10日，在藏品缺乏的情况下，大量运用模型等手段，成功举办了第一次陈列展览。

				    1930年12月1日，河南省国民政府将“河南省民族博物院”恢复为“河南博物馆”，并确定为社会教育机关，直属省教育厅领导。12月23日教育厅委任关百益为馆长，并收回民众师范房舍为古物陈列室。1931年1月20日，河南省教育厅又颁布了《河南博物馆组织条例》，其中明确博物馆的宗旨为：“一、发扬固有文化；二、提倡学术研究；三、增长民众知识；四、促进社会文明”。同时设立了保管部、搜集研究部两个大部，成立了由民政厅厅长、教育厅厅长、河南大学校长、博物馆馆长等组成的7人理事会，将原民族博物院的19个陈列室调整为7个，撤去了大量民族服饰和模型，充实了历史文物。1930年至1937年的8年间，是河南博物馆空前发展的时期，藏品中的历史文物最为丰富、精致，具有河南地方特点，而且涌现出以关百益为代表的一批高水平的研究人员。从此，河南博物馆名声鹊起，得到了国内外的广泛赞誉。1937年“七七事变”爆发，日本帝国主义大肆侵入。为避免文物被毁，馆藏主要文物68箱被迫移运重庆，工作处于停滞状态。1940年日伪期间，河南博物馆被更名为“河南省立博物馆”，下设事务部、保馆部、研究部等。抗战结束后，国民党河南省政府派谢孟刚为接收委员，接收了日伪当局控制下的河南省博物馆，但终因解放战争的爆发，国民党政府忙于内战，经济严重匮乏，经费拮据，博物馆步履维艰。

				    1948年，中国人民解放军势如破竹，一举解放了古都开封。党和政府十分重视文化教育和文博事业，立即成立了以赵干亭为主的三人管理小组，进驻博物馆，整饬馆务。1949年11月，河南省政府任命省教育厅厅长曲乃生兼任馆长，开始组织人员，整理文物、展室，修缮房舍、设施，进行业务活动，博物馆再次出现生机，蓬勃发展。

				    1953年，根据中央文化部颁发的《对地方博物馆的方针、任务、性质及发展方向的意见》，河南省博物馆被确定为地志性博物馆。1961年，河南省博物馆由开封迁至省会郑州，有了较好的陈列展览场地。然而，正当博物馆有计划、有秩序地全面开展各项业务活动的时候，一场史无前例的文化大革命开始了。

				    文革10年中，博物馆组织瘫痪，业务荒废。党的十一届三中全会以后，河南省博物馆渐入佳境，进入了一个新的历史发展时期。尤其是进入80年代，博物馆力量不断壮大，机构设置趋于合理，设立了陈列部、保管部、社会教育  部、图书室、研究部、《中原文物》编辑部、办公室、行管科、保卫科等科室，建立建全了岗位责任制和各项规章制度，博物馆呈现出一派欣欣向荣的新景象。

				    日月交替，沧桑更迭。历史的车轮驶入90年代。随着改革开放的深入，国际间日益频繁的文化交流，旅游事业的飞速发展，进一步促进带动了全国博物馆事业的发展。由于河南省博物馆建筑是1958年大跃进时期突击在郑州兴建的，它无论在建筑形式、建筑规模、还是在内部设施上，都很难适应今天博物馆日益发展的需要。为此，河南省委、省政府领导高瞻远瞩，决定“八五”期间在省会郑州建设一座具有当今先进水平的现代化博物馆。1991年秋，根据李瑞环同志的有关指示，经原省委书记侯宗宾、原省长李长春等领导同志的积极争取，国务院决定由国家和河南省共同投资筹建新馆舍。

				    新馆位于郑州市农业路中段，占地10 余万平方米，建筑面积7.8万平方米，累计投资近3亿元人民币，历时5年建成。主体展馆位于院区中央，呈金字塔形，后为文物库房，四隅分布有电教楼、综合服务楼、办公楼、培训楼等。整体建筑结构严谨、气势宏伟，造型古朴典雅，具有独特的艺术风格，同时也体现了中原文化的特点。

				    按照国家级现代化博物馆的要求，新馆内部设施完善，功能齐全。内有自动消防系统、安防监控系统、办公自动化管理系统、文物保护系统、电教系统、楼宇自动化系统等设施。1997年7月，河南省政府决定，将中原石刻艺术馆与河南省博物馆合并，成立河南博物院。河南博物院的成立，是河南博物馆事业发展的一个里程碑，也是中国博物馆发展史上的一桩盛事。

				    二、从白手起家到文物收藏大馆

				    河南地处中原，历史悠久，文物丰富，是中华文明重要的发源地之一。自古以来，我们的祖先就在片辽阔的土地上繁衍、生息，创造了绚丽多彩的古代文化，这就为河南博物院的发展奠定了坚实的物质基础。

				    河南博物院创建之初，就十分重视文物的征集工作，但由于当时缺泛经验，博物馆工作带有很大的盲目性和随意性，征集藏品往往是单纯的“网罗珍奇”，藏品颇为复杂，而且良莠不齐。

				    1930年至1936年间，是旧河南博物馆藏品保管工作的繁荣时期，无论是在藏品的征集、整理或在对藏品的研究上，都做了大量卓有成效的工作。尤其是在关百益先生的带领下，先后接收了古物保存委员会所存的所有文物，其中包括1923年新郑出土的春秋铜器，1925年11月鄢陵城关出土的宋代窖藏瓷器，洛阳等地的历代石刻等。1934年、1935年又先后征集了大量的古代名人书画及现代艺术品，从而大大丰富和提高了博物馆藏品的数量和质量。特别值得一提的是，博物馆还主动进行了几次田野发掘，获得了大量的出土文物。这个时期拥有的藏品不仅数量多，而且质量精，弥足珍贵。如新郑出土的莲鹤方壶、大型列鼎、王子婴次炉、编钟等；登封县的九柄玉如意；石刻中的北魏石棺，刘根造像碑、魏志8种、隋代四面造像、舍利塔铭、唐代泉男生墓志、宋代二体石经、金代进士题名碑等。正因为拥有大量的文物精品，所以在全国博物馆界的地位大大提高，在国外也深受赞扬。当时曾有这样的评论：“统中国博物馆所藏物品，除故宫博物院外，河南博物馆堪居第二之位置。”

				    抗日战争时期，为了确保文物安全，河南博物馆工作人员以满腔的爱国热忱和高度的责任心，精心挑选文物珍品5678件，拓片1162张，图书1472套（册），分装68箱运汉口，存放于法国租界。1938年9月，随着国内形势日趋危急，存放于汉口的文物又辗转运至重庆，从而避免了日寇的劫掠和破坏。而存留于开封的文物，在开封沦陷后，大部分铜器、铁器下落不明。存放于重庆的68箱文物，于1949年11月，由国民党政府挑选38箱，其中文物5119件，图书1450套（册）运往台湾。至此，河南博物馆元气大伤，苦心经营20余年的文物大馆，已无精品可言，博物馆名存实亡。

				    新中国成立后，在党和政府的关怀支持下，河南博物院得天时，占地利，重整旗鼓，大力开展文物征集工作，通过调查、收购、接受捐赠、发掘、拣选、调拨等，很快恢复了元气。而且，馆藏文物的数量和质量已非昔日可比。迄今为止，馆藏文物达十万件，特别是史前文物、商周青铜器和历代陶瓷器，享誉世界，具有较高的历史、科学、艺术价值。如郑州的大河村遗址出的新石器彩陶、临汝出土的彩绘鹳鱼石斧图陶缸、郑州窑藏青铜器、淅川下寺出土的楚国青铜器、平顶山应国墓地出土铜器、三门峡虢国墓地出土铜器、扶沟出土的楚国金银币、洛阳唐三彩、汝瓷、钧瓷等。另外，从1954年开始，博物院还曾多次派出征集人员，分赴革命老区，进行调查访问，征集了一大批宝贵的革命文物。同时，还接收了省军区、省民政厅等单位拨交的部分革命文物和有关资料，其中有许多珍品，如太平天国的布告、义和团的旗帜、吉鸿昌烈士就义时的血衣、彭雪枫烈士的遗物、《响导》周报、《新青年》杂志、《红旗报》《中州评论》《拂晓报》等。

				    近十年，随着文物工作的不断深入，湮埋已久的地下文物精品，终于重见天日，再现风采。为了配合河南博物院建设，发挥河南文物大省的优势，从不同侧面再现灿烂的河南古代文化，在省委、省政府及文化厅、文物局大力支持和关怀下，又陆续从中央、省直及各地市文物单位征调一大批文物精品。这些文物精品，犹如镶嵌在中原大地上的颗颗明珠，放射出斑斓璀灿的光华，它必将以无穷的魅力，吸引无数海内外的观光客。  
				     三、从《民族模型陈列》到《河南古代文化之光》

				    陈列展览是各项业务工作的中心环节。河南博物院创建伊始，就围绕这个中心开展工作。“民族博物馆”时期的《民族模型展览》，是河南博物院历史上举办的第一次陈列展览。陈列以塑像为主，配合照片，展出古今中外各民族模型。展出后，引起了当时开封各阶层和市民的轰动，“参观者为之途塞”。

				    1930年至1937的"河南博物馆"时期，在广泛收集历史文物、民俗文物和各类自然标本的基础上，先后开放的陈列室有13个。如安阳殷墟出土器物陈列室、新郑古器物陈列室、洛阳古物陈列室、岩石陈列室、民族模型陈列室、开封相国寺旧藏文物陈列室、石刻室、藏经陈列室、植物、矿物标本陈列室、书画陈列室等。由于当时的陈列水平有限，在"唯器物论"的思想指导下，采取器物堆砌的办法，陈列质量较差，但仍能看出当时的"河南博物馆"已初具规模，是我国博物院中的皎皎者。

				    1937年，在馆藏文物精品运抵重庆后，开封本馆所属藏品仍继续陈列开放，但数量和质量均大为逊色。1938年日本侵略军占领开封，博物馆被迫停止活动，直到1940年日伪统治下，把博物馆改名为"河南省立博物馆"，才将原陈列开放。

				    解放后，河南博物院获得了新生。1949-1961年间，除举办《河南自然环境与资源》《河南历史》《河南革命文物》三个基本陈列外，还举办展览数十个，内容多数与各个时期的中心任务和政治运动有关。如《从猿到人展览》（1950年）《镇压反革命展览》（1951年）《伟大祖国展览》（1952年）《青铜器展览》（1952年）《历代服饰展览》（1954年）《肃反展览》（1956年）等。

				    1961年至1966年五六年间，是河南博物院稳步发展的时期，也是举办展览较多的一个时期。迁郑之初，立即与省文物队联合举办了《河南省历史文物展览》，展出文物2000余件，每天观众如潮，川流不息，赢得了广大群众的好评。1963年举办的《河南革命文物展览》、以实物、图片、绘画、文字等较为系统地再现了河南革命斗争史。1964年，在原有《历史文物展览》的基础上，经过深入的研究、设计、制作，举办了迁郑后的第一个基本陈列--《河南历史陈列》，集中反映了河南古代历史概况。

				    “文化大革命”时期，陈列展览工作受到了极大的冲击，展览被污为“黑展览”而被查封。在这种恶劣的环境下，博物院职工还是以高度的责任心举办了几次富有教育意义的展览。如《抗大校史展览》《焦裕禄事迹展》《林县红旗渠展览》《洛阳煤矿史展览》等。

				    1977年到1997年的20年，可以说是河南博物院大发展的20年，陈列展览工作做得有声有色，并逐步确立了全国文物大馆的地位。首先于1980年重新恢复了《河南历史陈列》。该陈列在"文革"前陈列的基础上，增加了新的内容，采用了新的陈列设备和手段，使之更趋于科学化和大众化，真正成为人民群众喜闻乐见的文化园地。1981年以来，又先后举办了《河南革命文物陈列》《古代雕塑艺术陈列》《古代建筑艺术陈列》《馆藏明清书画展》《馆藏文物精品展》以及《楚国青铜器展》等几十个展览，观众人数逐年递增，年平均观众达30余万人次。

			    </p>
			</div>
			<div id="article_footer">
				<i class="el-icon-edit"></i>
				<i class="el-icon-star-off"></i>
				<i class="el-icon-share"></i>
			</div>
			<fix :box="article_con" :fixedShow="fixedShow" @goHome="gohome"></fix>
			
		</div>
	</transition>
</template>

<script type="text/javascript">
	import Fix from './fix'
	export default{
		props: {
			//isShow: false
		},
		mounted(){
			var _this = this;
			$('#article_con').scroll(function(e){
				_this.fixedShow = ( $(this).scrollTop() > 500 )   // 滚动高度超过500px时显示固定框
				//console.log($(this).scrollTop())
				_this.article_con = $(this)
			})
		},
		beforeUpdate: function (argument) {
			//console.log('beforeUpdate')
		},
		updated: function () {   //更新完成状态
			//$("#article_con").scrollTop(0)
			//console.log('updated')
        },
		data() {
			return {
				isShow: false,
				fixedShow: false,
				article_con: {}
			}
		},
		methods: {
			show() {
				this.isShow = true
				//$("#article_con").scrollTop(0)
				//console.log($('#article_con').offset())     //无法正确获取滚动高度
				$("#article_con").animate({ scrollTop: 0 }, 20);
			},
			hide() {
				this.isShow = false
			},
			gohome() {
				this.isShow = false
			}
			
		},
		components: {
			Fix
		}
	}
</script>

<style lang="stylus" scoped>
#article{
	width: 100.5%
	height: 100%
	position: fixed
	top: 0
	bottom: 0
	background: #fff
	z-index: 5
	&.article-enter-active, &.article-leave-active{
		transition: all .5s
	}
	&.article-enter, &.article-leave-to{
		transform: translate3d(100%, 0, 0)
	}
	#article_header{
		width: 100%
		height: 60px
		line-height: 60px
		border-bottom: 1px solid #B2B2B2
		color: #741a1a
		font-size: 22px
		i{
			font-size: 30px
			line-height: 60px
			margin-left: 15px
			float: left
			&.el-icon-refresh{
				float: right
				margin-right: 25px
			}
		}
		p{
			width: 100%
			text-align: center
		}
	}
	#article_con{
		position: absolute
		top: 60px
		bottom: 60px
		left: 20px
		overflow: scroll
		padding-top: 20px
		padding-right: 20px
		font-size: 19px
		.article_main{
			text-indent: 2em
		}
	}
	#article_footer{
		position: fixed
		bottom: 0
		width: 100%
		left: 0
		height: 60px
		border-top: 1px solid #DDDDDD
		font-size: 34px
		display: flex
		color: #741a1a
		i{
			flex: 1
			line-height: 60px
			text-align: center
		}
	}
	
}
</style>